#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # acme_certificate.certificate will be destroyed
  - resource "acme_certificate" "certificate" {
      - account_key_pem    = (sensitive value)
      - certificate_domain = "*.foreignlanguagereader.com" -> null
      - certificate_p12    = (sensitive value)
      - certificate_pem    = <<~EOT
            -----BEGIN CERTIFICATE-----
            MIIFbDCCBFSgAwIBAgISBDele5Mt8jKbkV9mf/1YcRgOMA0GCSqGSIb3DQEBCwUA
            MEoxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MSMwIQYDVQQD
            ExpMZXQncyBFbmNyeXB0IEF1dGhvcml0eSBYMzAeFw0yMDAzMTUxODI2MzZaFw0y
            MDA2MTMxODI2MzZaMCYxJDAiBgNVBAMMGyouZm9yZWlnbmxhbmd1YWdlcmVhZGVy
            LmNvbTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAKdKfNnA1WyJ7+xZ
            Xx28n9q618jMbwsBa6rITFIdXEIVs0QpyW5jVZMhij5WMdBmC869WYVXoT0T4gaK
            nFmLEjLHmxap7+u1dYBLOL7BmTTlSSxzp0sRU1zArmJEU9gHOzx8jXyDTeDJy0Vm
            EiXkOsZzpn4ucW3GxAca2akdn+zAmBO/3ASl4poRgGGQvx6jMXPSy2u5MqPquRxO
            CC6jKk6ZBCPCWYLPynNzsCbFqM2mlGj6yc6EBGVbwoHUY9zzZjqk1D9ckom/GHCa
            jpKabGod/Z76n1bXXWdY8QT6XDjT2OSwuhrf76/d6jREZ1FXjOA3k8CoZw3czQ2F
            1cmff28CAwEAAaOCAm4wggJqMA4GA1UdDwEB/wQEAwIFoDAdBgNVHSUEFjAUBggr
            BgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAdBgNVHQ4EFgQUbfff+aN0
            oV6Gb/WflkQagurlkMUwHwYDVR0jBBgwFoAUqEpqYwR93brm0Tm3pkVl7/Oo7KEw
            bwYIKwYBBQUHAQEEYzBhMC4GCCsGAQUFBzABhiJodHRwOi8vb2NzcC5pbnQteDMu
            bGV0c2VuY3J5cHQub3JnMC8GCCsGAQUFBzAChiNodHRwOi8vY2VydC5pbnQteDMu
            bGV0c2VuY3J5cHQub3JnLzAmBgNVHREEHzAdghsqLmZvcmVpZ25sYW5ndWFnZXJl
            YWRlci5jb20wTAYDVR0gBEUwQzAIBgZngQwBAgEwNwYLKwYBBAGC3xMBAQEwKDAm
            BggrBgEFBQcCARYaaHR0cDovL2Nwcy5sZXRzZW5jcnlwdC5vcmcwggECBgorBgEE
            AdZ5AgQCBIHzBIHwAO4AdQCyHgXMi6LNiiBOh2b5K7mKJSBna9r6cOeySVMt74uQ
            XgAAAXDfqZBOAAAEAwBGMEQCICs9rPhEzrRTM6VWXnFHicihlEYTI992qgn/XPDn
            oIR3AiAmUbF9GGLBLlRpNGV+ZcPIxz9Ds2GIh5vIUFnPnWQT0QB1AG9Tdqwx8DEZ
            2JkApFEV/3cVHBHZAsEAKQaNsgiaN9kTAAABcN+pkRMAAAQDAEYwRAIgDA42oTQi
            nyP5W2BeZmbo3tvN4WvBGDaGLf1QpT7xQ4YCICelDO2r5h9ws8lBfbsUpvlBO+fo
            DT6MRgn+LiQxDjONMA0GCSqGSIb3DQEBCwUAA4IBAQAaQ56W2hK682qgpgvo7mnm
            qKwNVPMRnFHSIR0Fu/C6uzAjBVeVYp2IsGf15UhumtZRDB2Xgqxee0Z8XDHHVJen
            lIYPe9/53jk1ZwEYyuaN6NdbI0OQOHp2sZdc6EpgK8sCVy7r9YjE/9TjZMR/Vtu6
            4IWYeig0clUeI5TRPhftLlUXu4bY07BlAR+7sF9uGpt6aos6EzAUg8AIBjKzsUb7
            HGRVx88g8qvbXsE6r6+e1l/msQqiTuwq1QiZSi4ihCoZxzeKjsace0hYabAn+bc3
            tWN/YNco8gCO5pG+CkHtN4DGuqjpx4dSj1DawkFSnHdkf74YekNoyMK61JbsAzRM
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_url    = "https://acme-v02.api.letsencrypt.org/acme/cert/0437a57b932df2329b915f667ffd5871180e" -> null
      - common_name        = "*.foreignlanguagereader.com" -> null
      - id                 = "https://acme-v02.api.letsencrypt.org/acme/cert/0437a57b932df2329b915f667ffd5871180e" -> null
      - issuer_pem         = <<~EOT
            -----BEGIN CERTIFICATE-----
            MIIEkjCCA3qgAwIBAgIQCgFBQgAAAVOFc2oLheynCDANBgkqhkiG9w0BAQsFADA/
            MSQwIgYDVQQKExtEaWdpdGFsIFNpZ25hdHVyZSBUcnVzdCBDby4xFzAVBgNVBAMT
            DkRTVCBSb290IENBIFgzMB4XDTE2MDMxNzE2NDA0NloXDTIxMDMxNzE2NDA0Nlow
            SjELMAkGA1UEBhMCVVMxFjAUBgNVBAoTDUxldCdzIEVuY3J5cHQxIzAhBgNVBAMT
            GkxldCdzIEVuY3J5cHQgQXV0aG9yaXR5IFgzMIIBIjANBgkqhkiG9w0BAQEFAAOC
            AQ8AMIIBCgKCAQEAnNMM8FrlLke3cl03g7NoYzDq1zUmGSXhvb418XCSL7e4S0EF
            q6meNQhY7LEqxGiHC6PjdeTm86dicbp5gWAf15Gan/PQeGdxyGkOlZHP/uaZ6WA8
            SMx+yk13EiSdRxta67nsHjcAHJyse6cF6s5K671B5TaYucv9bTyWaN8jKkKQDIZ0
            Z8h/pZq4UmEUEz9l6YKHy9v6Dlb2honzhT+Xhq+w3Brvaw2VFn3EK6BlspkENnWA
            a6xK8xuQSXgvopZPKiAlKQTGdMDQMc2PMTiVFrqoM7hD8bEfwzB/onkxEz0tNvjj
            /PIzark5McWvxI0NHWQWM6r6hCm21AvA2H3DkwIDAQABo4IBfTCCAXkwEgYDVR0T
            AQH/BAgwBgEB/wIBADAOBgNVHQ8BAf8EBAMCAYYwfwYIKwYBBQUHAQEEczBxMDIG
            CCsGAQUFBzABhiZodHRwOi8vaXNyZy50cnVzdGlkLm9jc3AuaWRlbnRydXN0LmNv
            bTA7BggrBgEFBQcwAoYvaHR0cDovL2FwcHMuaWRlbnRydXN0LmNvbS9yb290cy9k
            c3Ryb290Y2F4My5wN2MwHwYDVR0jBBgwFoAUxKexpHsscfrb4UuQdf/EFWCFiRAw
            VAYDVR0gBE0wSzAIBgZngQwBAgEwPwYLKwYBBAGC3xMBAQEwMDAuBggrBgEFBQcC
            ARYiaHR0cDovL2Nwcy5yb290LXgxLmxldHNlbmNyeXB0Lm9yZzA8BgNVHR8ENTAz
            MDGgL6AthitodHRwOi8vY3JsLmlkZW50cnVzdC5jb20vRFNUUk9PVENBWDNDUkwu
            Y3JsMB0GA1UdDgQWBBSoSmpjBH3duubRObemRWXv86jsoTANBgkqhkiG9w0BAQsF
            AAOCAQEA3TPXEfNjWDjdGBX7CVW+dla5cEilaUcne8IkCJLxWh9KEik3JHRRHGJo
            uM2VcGfl96S8TihRzZvoroed6ti6WqEBmtzw3Wodatg+VyOeph4EYpr/1wXKtx8/
            wApIvJSwtmVi4MFU5aMqrSDE6ea73Mj2tcMyo5jMd6jmeWUHK8so/joWUoHOUgwu
            X4Po1QYz+3dszkDqMp4fklxBwXRsW10KXzPMTZ+sOPAveyxindmjkW8lGy+QsRlG
            PfZ+G6Z6h7mjem0Y+iWlkYcV4PIWL1iwBi8saCbGS5jN2p8M+X+Q7UNKEkROb3N6
            KOqkqm57TH2H3eDJAkSnh6/DNFu0Qg==
            -----END CERTIFICATE-----
        EOT -> null
      - key_type           = "2048" -> null
      - min_days_remaining = 30 -> null
      - must_staple        = false -> null
      - private_key_pem    = (sensitive value)

      - dns_challenge {
          - config   = (sensitive value)
          - provider = "digitalocean" -> null
        }
    }

  # acme_registration.reg will be destroyed
  - resource "acme_registration" "reg" {
      - account_key_pem  = (sensitive value)
      - email_address    = "letsencrypt@lucaskjaerozhang.com" -> null
      - id               = "https://acme-v02.api.letsencrypt.org/acme/acct/80671760" -> null
      - registration_url = "https://acme-v02.api.letsencrypt.org/acme/acct/80671760" -> null
    }

  # tls_private_key.tls_private_key will be destroyed
  - resource "tls_private_key" "tls_private_key" {
      - algorithm                  = "RSA" -> null
      - ecdsa_curve                = "P224" -> null
      - id                         = "b6f351cc8a1ea25172123e9bfe752e5230cd0f53" -> null
      - private_key_pem            = (sensitive value)
      - public_key_fingerprint_md5 = "fd:c6:1f:fb:bf:ab:18:bb:71:c7:76:23:3a:32:a3:ce" -> null
      - public_key_openssh         = <<~EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCvCU6PsrfHLpRUbIFsLIpbjoLNjC+rYHiaqT4spJqsGHredOp1wXB/dKFceLRSimW+HO2x7deXtBN6w5uG4t0YZ7pSz7DMfOfuQ2dplxb+faxBRSq7LFYt4Kwkn23xnEGujU3qmrmGlLpTx9gccpz9rdK+fSbL+qP3QO5ncNY/xf+MYWx2YxrGKSbP7gd19yGHAlZkfkEI0PegWZMNqAgXzT3xrnYtyb8MbJCRGAmeLds6cqfzQ/xawodREJNOjAggK4FVtu60QAow7dE7485dndOadzXUHbdj7eKJlhA5vR2IIB8sDEKSKmfv4nsgDuJVJTqDEXak+lEZEwDYsbZf
        EOT -> null
      - public_key_pem             = <<~EOT
            -----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEArwlOj7K3xy6UVGyBbCyK
            W46CzYwvq2B4mqk+LKSarBh63nTqdcFwf3ShXHi0Uoplvhztse3Xl7QTesObhuLd
            GGe6Us+wzHzn7kNnaZcW/n2sQUUquyxWLeCsJJ9t8ZxBro1N6pq5hpS6U8fYHHKc
            /a3Svn0my/qj90DuZ3DWP8X/jGFsdmMaxikmz+4HdfchhwJWZH5BCND3oFmTDagI
            F8098a52Lcm/DGyQkRgJni3bOnKn80P8WsKHURCTTowIICuBVbbutEAKMO3RO+PO
            XZ3Tmnc11B23Y+3iiZYQOb0diCAfLAxCkipn7+J7IA7iVSU6gxF2pPpRGRMA2LG2
            XwIDAQAB
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                   = 2048 -> null
    }

  # module.infrastructure.acme_certificate.certificate will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem    = (sensitive value)
      + certificate_domain = (known after apply)
      + certificate_p12    = (sensitive value)
      + certificate_pem    = (known after apply)
      + certificate_url    = (known after apply)
      + common_name        = "*.foreignlanguagereader.com"
      + id                 = (known after apply)
      + issuer_pem         = (known after apply)
      + key_type           = "2048"
      + min_days_remaining = 30
      + must_staple        = false
      + private_key_pem    = (sensitive value)

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "digitalocean"
        }
    }

  # module.infrastructure.acme_registration.reg will be created
  + resource "acme_registration" "reg" {
      + account_key_pem  = (sensitive value)
      + email_address    = "letsencrypt@lucaskjaerozhang.com"
      + id               = (known after apply)
      + registration_url = (known after apply)
    }

  # module.infrastructure.tls_private_key.tls_private_key will be created
  + resource "tls_private_key" "tls_private_key" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.infrastructure.module.kubernetes_config.helm_release.cert_manager will be destroyed
  - resource "helm_release" "cert_manager" {
      - atomic                = false -> null
      - chart                 = "cert-manager" -> null
      - cleanup_on_fail       = false -> null
      - dependency_update     = false -> null
      - disable_crd_hooks     = false -> null
      - disable_webhooks      = false -> null
      - force_update          = false -> null
      - id                    = "cert-manager" -> null
      - max_history           = 0 -> null
      - metadata              = [
          - {
              - chart     = "cert-manager"
              - name      = "cert-manager"
              - namespace = "cert-manager"
              - revision  = 1
              - values    = "null"
              - version   = "v0.13.1"
            },
        ] -> null
      - name                  = "cert-manager" -> null
      - namespace             = "cert-manager" -> null
      - recreate_pods         = false -> null
      - render_subchart_notes = true -> null
      - replace               = false -> null
      - repository            = "https://charts.jetstack.io" -> null
      - reset_values          = false -> null
      - reuse_values          = false -> null
      - skip_crds             = false -> null
      - status                = "deployed" -> null
      - timeout               = 300 -> null
      - verify                = false -> null
      - version               = "v0.13.1" -> null
      - wait                  = true -> null
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_namespace.cert_manager will be destroyed
  - resource "kubernetes_namespace" "cert_manager" {
      - id = "cert-manager" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "cert-manager" -> null
          - resource_version = "1766" -> null
          - self_link        = "/api/v1/namespaces/cert-manager" -> null
          - uid              = "4602c8ef-f218-45df-a90b-86bb08972fe9" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.nginx_certificate will be created
  + resource "kubernetes_secret" "nginx_certificate" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/tls"

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-certificate"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 5 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
